RomanLut/hx-esp32-cam-fpv/components/air/main.cpp
                count -= c;
                s_video_frame_data_size += c;
                s_video_full_frame_size += c;

#ifdef PROFILE_CAMERA_DATA    
                s_profiler.set(PF_CAMERA_DATA_SIZE, s_video_full_frame_size / 1024);
#endif

                size_t c8 = c >> 3;
                for (size_t i = c8; i > 0; i--)
                {
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                    *ptr++ = *src; src += stride;
                }
                for (size_t i = c - (c8 << 3); i > 0; i--)
                {
                    *ptr++ = *src; src += stride;
                }

#ifdef DVR_SUPPORT
                if (s_air_record)
                {
                    add_to_sd_fast_buffer(start_ptr, c);
                }
#endif
            }
        }

        //////////////////

        if (last && s_video_frame_started)
        {
            s_video_frame_started = false;

            //frame pacing!
            int64_t now = esp_timer_get_time();

            int64_t acquire_dt = now - s_video_last_acquired_tp;
            s_video_last_acquired_tp = now;

            int64_t send_dt = now - s_video_last_sent_tp;
            if (send_dt < s_video_target_frame_dt) //limit fps
            {
                s_video_skip_frame = true;
            }
            else                
            {
                s_video_skip_frame = false;
                s_video_last_sent_tp += std::max(s_video_target_frame_dt, acquire_dt);
            }

/*
            //dynamically decrease fps
            if ( s_wlan_outgoing_queue.size() > s_wlan_outgoing_queue.capacity()  * 60 / 100)
            {
                s_video_skip_frame = true;
            }
*/
            //////////////////

            //LOG("Finish: %d %d\n", s_video_frame_index, s_video_frame_data_size);
            if (s_video_frame_data_size > 0) //left over
                send_air2ground_video_packet(true);

            s_video_frame_data_size = 0;
            if ( !s_video_skip_frame) s_video_frame_index++;
            s_video_part_index = 0;
        }

        if ( last && (s_video_full_frame_size > 0))
        {
            if ( (s_stats.camera_frame_size_min == 0) || (s_stats.camera_frame_size_min > s_video_full_frame_size) )
            {
                s_stats.camera_frame_size_min = s_video_full_frame_size;
            } 

            if ( s_stats.camera_frame_size_max < s_video_full_frame_size )
            {
                s_stats.camera_frame_size_max = s_video_full_frame_size;
            } 

            recalculateFrameSizeQualityK(s_video_full_frame_size);
            applyAdaptiveQuality();
            s_video_full_frame_size = 0;
            s_stats.fec_spin_count += s_fec_spin_count;
            s_fec_spin_count = 0;
#ifdef PROFILE_CAMERA_DATA    
            s_profiler.set(PF_CAMERA_DATA_SIZE, 0);
#endif

            handle_ground2air_config_packetEx2(false);

            if ( (g_osd.isChanged() || (s_osdUpdateCounter == 15)) && !g_osd.isLocked() )
            {
                send_air2ground_osd_packet();
                s_osdUpdateCounter = 0;
            }
            else
            {
                s_osdUpdateCounter++;
            }

#ifdef UART_MAVLINK
            send_air2ground_data_packet();
#endif            

        }
    }

    s_fec_encoder.unlock();

#ifdef PROFILE_CAMERA_DATA    
    if (last)
    {
        s_profiler.set(PF_CAMERA_FRAME_QUALITY, s_quality);
    }
#endif

#ifdef PROFILE_CAMERA_DATA    
    s_profiler.set(PF_CAMERA_DATA, 0);
#endif

    return count;
}

//=============================================================================================
//=============================================================================================
static void init_camera()
{
    camera_config_t config;
    config.ledc_channel = LEDC_CHANNEL_0;
    config.ledc_timer = LEDC_TIMER_0;
    config.pin_d0 = Y2_GPIO_NUM;
    config.pin_d1 = Y3_GPIO_NUM;
    config.pin_d2 = Y4_GPIO_NUM;
    config.pin_d3 = Y5_GPIO_NUM;
    config.pin_d4 = Y6_GPIO_NUM;
    config.pin_d5 = Y7_GPIO_NUM;
    config.pin_d6 = Y8_GPIO_NUM;
    config.pin_d7 = Y9_GPIO_NUM;
    config.pin_xclk = XCLK_GPIO_NUM;
    config.pin_pclk = PCLK_GPIO_NUM;
    config.pin_vsync = VSYNC_GPIO_NUM;
    config.pin_href = HREF_GPIO_NUM;
    config.pin_sccb_sda = SIOD_GPIO_NUM;
    config.pin_sccb_scl = SIOC_GPIO_NUM;
    config.pin_pwdn = PWDN_GPIO_NUM;
    config.pin_reset = RESET_GPIO_NUM;
#ifdef SENSOR_OV5640    
    config.xclk_freq_hz = 26000000;  //real frequency will be 80Mhz/3 = 26,666Mhz
#else
    config.xclk_freq_hz = 12000000;  //real frequency will be 80Mhz/6 = 13,333Mhz and we use clk2x
#endif    
    config.pixel_format = PIXFORMAT_JPEG;
    config.frame_size = FRAMESIZE_SVGA;
    config.jpeg_quality = 63;  //start from lowest quality to decrease pressure at startup
    config.fb_count = 2;
    config.grab_mode = CAMERA_GRAB_LATEST;
    config.fb_location = CAMERA_FB_IN_DRAM;
    config.data_available_callback = camera_data_available;

    // camera init
    esp_err_t err = esp_camera_init(&config);
    if (err != ESP_OK)
    {
        LOG("Camera init failed with error 0x%x", err);
        return;
    }
}

//#define SHOW_CPU_USAGE

//=============================================================================================
//=============================================================================================
static void print_cpu_usage()
{
#ifdef SHOW_CPU_USAGE
    TaskStatus_t* pxTaskStatusArray;
    volatile UBaseType_t uxArraySize, x;
    uint32_t ulTotalRunTime, ulStatsAsPercentage;

    // Take a snapshot of the number of tasks in case it changes while this
    // function is executing.
    uxArraySize = uxTaskGetNumberOfTasks();
    //LOG("%u tasks\n", uxArraySize);

    // Allocate a TaskStatus_t structure for each task.  An array could be
    // allocated statically at compile time.
    pxTaskStatusArray = (TaskStatus_t*)heap_caps_malloc(uxArraySize * sizeof(TaskStatus_t), MALLOC_CAP_SPIRAM);

    if (pxTaskStatusArray != NULL)
    {
        // Generate raw status information about each task.
        uxArraySize = uxTaskGetSystemState(pxTaskStatusArray, uxArraySize, &ulTotalRunTime);
        //LOG("%u total usage\n", ulTotalRunTime);

        // For percentage calculations.
        ulTotalRunTime /= 100UL;

        // Avoid divide by zero errors.
        if (ulTotalRunTime > 0)
        {
            // For each populated position in the pxTaskStatusArray array,
            // format the raw data as human readable ASCII data
            for (x = 0; x < uxArraySize; x++)
            {
                // What percentage of the total run time has the task used?
                // This will always be rounded down to the nearest integer.
                // ulTotalRunTimeDiv100 has already been divided by 100.
                ulStatsAsPercentage = pxTaskStatusArray[x].ulRunTimeCounter / ulTotalRunTime;

